Config/DataProcessors/НастройкаПоставокФорматовОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>НастройкаПоставокФорматовОбмена</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Config/InformationRegisters/СоставПоставокФорматовОбменаБанкиКС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СоставПоставокФорматовОбменаБанкиКС</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВключенВПоставку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Поставка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоставкиФорматовОбменаБанкиКС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФорматОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФорматыОбменаБанкиКС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/DataProcessors/НастройкаПоставокФорматовОбмена/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыОбъектыИФорматыПоставки

&НаКлиенте
Процедура ОбъектыИФорматыПоставкиПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	Перем Поставка;
		
	Если Элементы.ПоставкиФорматовОбмена.ТекущиеДанные<>Неопределено Тогда
		Поставка = Элементы.ПоставкиФорматовОбмена.ТекущаяСтрока;
	КонецЕсли;
	
	Если ПараметрыПеретаскивания.Значение.Количество() = 1 Тогда
		ФорматОбмена = ПараметрыПеретаскивания.Значение[0];
		
		ПараметрыФормы = Новый Структура;
		ЗначенияЗаполнения = Новый Структура;
		ЗначенияЗаполнения.Вставить("ФорматОбмена",ФорматОбмена);
		ЗначенияЗаполнения.Вставить("Поставка",Поставка);
		ЗначенияЗаполнения.Вставить("ВключенВПоставку",Истина);
		ПараметрыФормы.Вставить("ЗначенияЗаполнения",ЗначенияЗаполнения);
	    ОткрытьФорму("РегистрСведений.СоставПоставокФорматовОбменаБанкиКС.Форма.ФормаЗаписи",ПараметрыФормы,ЭтаФорма,,,, Неопределено, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		МассивФорматов = Новый Массив;
		Для Каждого ЭлМас Из ПараметрыПеретаскивания.Значение Цикл
			Если ТипЗнч(ЭлМас) = Тип("СправочникСсылка.ФорматыОбменаБанкиКС") Тогда
				МассивФорматов.Добавить(ЭлМас);
			КонецЕсли;
		КонецЦикла;
		Если МассивФорматов.Количество()
			И ЗначениеЗаполнено(Поставка) Тогда
			ВключитьМассивФорматовВПоставку(МассивФорматов,Поставка);
			Элементы.ОбъектыИФорматыПоставки.Обновить();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыТипыФорматов

&НаКлиенте
Процедура ПрименяемыеНастройкиФорматовОбменаПриАктивизацииСтроки(Элемент)
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	ПолеОтбора = НайтиполеОтбора("Поставка", ОбъектыИФорматыОбмена);
	
	Если ПолеОтбора <> Неопределено Тогда
		ПолеОтбора.ПравоеЗначение = Элемент.ТекущаяСтрока;
		ПолеОтбора.Использование = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыТипыОбмена

&НаКлиенте
Процедура ТипыОбменаПриАктивизацииСтроки(Элемент)
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПолеОтбора = НайтиполеОтбора("Владелец", Форматы);
	Если ПолеОтбора <> Неопределено тогда
		ПолеОтбора.ПравоеЗначение = Элемент.ТекущаяСтрока;
		ПолеОтбора.Использование = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьПоставку(Команда)
	ПараметрыФормы = Новый Структура;
	Если Элементы.ПоставкиФорматовОбмена.ТекущиеДанные<>Неопределено Тогда
		ПараметрыФормы.Вставить("Поставка",Элементы.ПоставкиФорматовОбмена.ТекущаяСтрока);
	КонецЕсли;
	ОткрытьФорму("Обработка.ВыгрузкаПоставкиФорматовОбменаБанкиКС.Форма.Форма", ПараметрыФормы,,,,, Неопределено, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьФорматы(Команда)
	ОткрытьФорму("Обработка.ПомощникЗагрузкиФорматовОбменаБанкиКС.Форма",,,,,, Неопределено, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВключитьМассивФорматовВПоставку(МассивФорматов,Поставка)
	Для Каждого ЭлМас Из МассивФорматов Цикл
		Запись = РегистрыСведений.СоставПоставокФорматовОбменаБанкиКС.СоздатьМенеджерЗаписи();
		Запись.Период = ТекущаяДата();
		Запись.Поставка = Поставка;
		Запись.ВключенВПоставку = Истина;
		Запись.ФорматОбмена = ЭлМас;
		Запись.Записать(Истина);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
		
	УсловноеОформление.Элементы.Очистить();
	
	// Представление типа казначейства
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ТипыОбменаТипКассовогоОргана");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТипыОбмена.ТипКассовогоОргана");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = "";
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "Не используется");
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НедоступныеДанныеЦвет);
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ТипыОбменаТипКассовогоОргана");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТипыОбмена.ТипКассовогоОргана");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = "СправочникСсылка.Банки";
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "Банк");
	
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ТипыОбменаТипКассовогоОргана");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТипыОбмена.ТипКассовогоОргана");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = "СправочникСсылка.Казначейства";
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "Казначейство");	
	
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ОбъектыИФорматыОбменаФормат");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ОбъектыИФорматыОбмена.ФорматОбмена");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных("ТекущийФормат");
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(,,Истина));
	
КонецПроцедуры

&НаКлиенте
Функция НайтиПолеОтбора(ИмяПоля, ТаблицаОтбора)
	НужноеПоле = Новый ПолеКомпоновкиДанных(ИмяПоля);
	ДоступноеПолеОтбора = Неопределено;
	ПолеНайдено = Ложь;
	Для каждого ПолеОтбора из ТаблицаОтбора.Отбор.Элементы цикл
		Если ПолеОтбора.ЛевоеЗначение = НужноеПоле тогда
			ДоступноеПолеОтбора = ПолеОтбора;
			ПолеНайдено = Истина;
		КонецЕсли;	
	КонецЦикла;	
	Если НЕ ПолеНайдено Тогда
		ДоступноеПолеОтбора = ТаблицаОтбора.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ДоступноеПолеОтбора.ЛевоеЗначение = НужноеПоле;
	КонецЕсли;
    Возврат ДоступноеПолеОтбора;
КонецФункции

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ЗагрузкаФорматовОбменаБанкиКС" Тогда
		Элементы.ТипыОбмена.Обновить();
		Элементы.ПоставкиФорматовОбмена.Обновить();
		Элементы.Форматы.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФорматыПриАктивизацииСтроки(Элемент)
	ТекДанные = Элементы.Форматы.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		ТекущийФормат = Неопределено;
	ИначеЕсли ТекДанные.Свойство("Ссылка") Тогда
		ТекущийФормат = ТекДанные.Ссылка;
	Иначе
		ТекущийФормат = Неопределено;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
